Autodesk.Revit.DB.MEPCurveType.Shape
The shape of the profile.
Since:
2019

Autodesk.Revit.DB.MEPCurveType.RoutingPreferenceManager
The RoutingPreferenceManager for the MEPCurveType
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.MEPCurveType.MultiShapeTransition
The default multi shape transition fitting of the MEP curve type.
Remarks: This property is used to retrieve the default multi shape transition fitting of the MEP curve type,
and can be null if there is no default value.
Use Autodesk.Revit.DB.RoutingPreferenceManager to set this property for PipeType MEPCurves.

Autodesk.Revit.DB.MEPCurveType.Elbow
The default elbow fitting of the MEP curve type.
Remarks: This property is used to retrieve the default elbow fitting of the MEP curve type,
and can be null if there is no default value.
Use Autodesk.Revit.DB.RoutingPreferenceManager to set this property for PipeType MEPCurves.

Autodesk.Revit.DB.MEPCurveType.Cross
The default cross fitting of the MEP curve type.
Remarks: This property is used to retrieve the default cross fitting of the MEP curve type,
and can be null if there is no default value.
Use Autodesk.Revit.DB.RoutingPreferenceManager to set this property for PipeType MEPCurves.

Autodesk.Revit.DB.MEPCurveType.Union
The default union fitting of the MEP curve type.
Remarks: This property is used to retrieve the default union fitting of the MEP curve type,
and can be null if there is no default value.
Use Autodesk.Revit.DB.RoutingPreferenceManager to set this property for PipeType MEPCurves.

Autodesk.Revit.DB.MEPCurveType.Transition
The default transition fitting of the MEP curve type.
Remarks: This property is used to retrieve the default transition fitting of the MEP curve type,
and can be null if there is no default value.
Use Autodesk.Revit.DB.RoutingPreferenceManager to set this property for PipeType MEPCurves.

Autodesk.Revit.DB.MEPCurveType.Tap
The default tap fitting of the MEP curve type.
Remarks: This property is used to retrieve the default tap fitting of the MEP curve type,
and can be null if there is no default value.
Use Autodesk.Revit.DB.RoutingPreferenceManager to set this property for PipeType MEPCurves.

Autodesk.Revit.DB.MEPCurveType.Tee
The default tee fitting of the MEP curve type.
Remarks: This property is used to retrieve the default tee fitting of the MEP curve type,
and can be null if there is no default value.
Use Autodesk.Revit.DB.RoutingPreferenceManager to set this property for PipeType MEPCurves.

Autodesk.Revit.DB.MEPCurveType.PreferredJunctionType
The preferred junction type of the MEP curve type.
Remarks: Use Autodesk.Revit.DB.RoutingPreferenceManager to set this property for PipeType MEPCurves.

Autodesk.Revit.DB.MEPCurveType.Roughness
The roughness of the MEP curve type.  For PipeTypes, please use Segment::Roughness

Autodesk.Revit.DB.MEPCurveType
The base type class for MEP curves, such as ducts, pipes, cable trays and conduits.